app/controllers/articles_controller.rb

	def create
		@article = Article.new(article_params)
		@article.save
---
INSERT INTO "articles" ("title", "body", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["title", "article no 2"], ["body", "this is the article 2 body."], ["created_at", "2015-06-02 09:46:37.008459"], ["updated_at", "2015-06-02 09:46:37.008459"]]

	def destroy
		Article.find(params[:id]).destroy
---
DELETE FROM "articles" WHERE "articles"."id" = $1  [["id", 4]]
SELECT  "articles".* FROM "articles" WHERE "articles"."id" = $1 LIMIT 1  [["id", 4]]

	def update
		@article = Article.find(params[:id])
		@article.update(article_params)
---
SELECT  "articles".* FROM "articles" WHERE "articles"."id" = $1 LIMIT 1  [["id", 6]]
UPDATE "articles" SET "body" = $1, "updated_at" = $2 WHERE "articles"."id" = $3  [["body", "This is article 6 body bla bla bla "], ["updated_at", "2015-06-03 07:25:45.675946"], ["id", 6]]